Revit 2016 API
ControlledApplication.IsQuiescent Property
 Returns if the current application is quiescent.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("Obsolete in Revit 2016. Use ExternalEvent or the Idling event to be able to make calls to the Revit API at the proper time when Revit is not busy in another tool.")]
public bool IsQuiescent { get; }
Visual Basic
<ObsoleteAttribute("Obsolete in Revit 2016. Use ExternalEvent or the Idling event to be able to make calls to the Revit API at the proper time when Revit is not busy in another tool.")> _
Public ReadOnly Property IsQuiescent As Boolean
	Get
Visual C++
[ObsoleteAttribute(L"Obsolete in Revit 2016. Use ExternalEvent or the Idling event to be able to make calls to the Revit API at the proper time when Revit is not busy in another tool.")]
public:
property bool IsQuiescent {
	bool get ();
}
Remarks
 This property can be used check if the current application is quiescent. If any document in the current application is in editing mode or an In-place family is being edited, it returns false. Otherwise, true will be returned.
See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace